robovero/firmware/src/wrap/_lpc17xx_can.c
/*******************************************************************************
 * @file
 * @purpose		
 * @version		0.1
 *------------------------------------------------------------------------------
 * Copyright (C) 2011 Gumstix Inc.
 * All rights reserved.
 *
 * Contributer(s):
 *   Neil MacMunn   <neil@gumstix.com>
 *------------------------------------------------------------------------------
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 
 * Redistributions of source code must retain the above copyright notice, this
 * 	list of conditions and the following disclaimer.
 * 
 * Redistributions in binary form must reproduce the above copyright notice,
 *  this list of conditions and the following disclaimer in the documentation
 *  and/or other materials provided with the distribution.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 ******************************************************************************/

#include "lpc17xx_can.h"

#include "return.h"

int _CAN_SetCommand(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	uint32_t CMRType;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CMRType = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);

	CAN_SetCommand(CANx, CMRType);
	return 0;
}

int _CAN_IRQCmd(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	CAN_INT_EN_Type arg;
	FunctionalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	arg = (CAN_INT_EN_Type) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);

	CAN_IRQCmd(CANx, arg, NewState);
	return 0;
}

int _FCAN_ReadObj(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* CANAFx;
	CAN_MSG_Type* CAN_Msg;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANAFx = (LPC_CANAF_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_Msg = (CAN_MSG_Type*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) FCAN_ReadObj(CANAFx, CAN_Msg));
	writeUSBOutString(str);
	return 0;
}

int _CAN_Init(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	uint32_t baudrate;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	baudrate = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);

	CAN_Init(CANx, baudrate);
	return 0;
}

int _CAN_ModeConfig(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	CAN_MODE_Type mode;
	FunctionalState NewState;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	mode = (CAN_MODE_Type) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	NewState = (FunctionalState) strtoul((char *) arg_ptr, NULL, 16);

	CAN_ModeConfig(CANx, mode, NewState);
	return 0;
}

int _CAN_LoadExplicitEntry(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	uint32_t ID;
	CAN_ID_FORMAT_Type format;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	ID = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	format = (CAN_ID_FORMAT_Type) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_LoadExplicitEntry(CANx, ID, format));
	writeUSBOutString(str);
	return 0;
}

int _CAN_LoadFullCANEntry(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	uint16_t ID;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	ID = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_LoadFullCANEntry(CANx, ID));
	writeUSBOutString(str);
	return 0;
}

int _CAN_IntGetStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_IntGetStatus(CANx));
	writeUSBOutString(str);
	return 0;
}

int _CAN_SetAFMode(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* CANAFx;
	CAN_AFMODE_Type AFmode;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANAFx = (LPC_CANAF_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AFmode = (CAN_AFMODE_Type) strtoul((char *) arg_ptr, NULL, 16);

	CAN_SetAFMode(CANAFx, AFmode);
	return 0;
}

