robovero/firmware/src/wrap/_lpc17xx_can.c
int _CAN_SendMsg(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	CAN_MSG_Type* CAN_Msg;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_Msg = (CAN_MSG_Type*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_SendMsg(CANx, CAN_Msg));
	writeUSBOutString(str);
	return 0;
}

int _CAN_LoadGroupEntry(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	uint32_t lowerID;
	uint32_t upperID;
	CAN_ID_FORMAT_Type format;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	lowerID = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	upperID = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	format = (CAN_ID_FORMAT_Type) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_LoadGroupEntry(CANx, lowerID, upperID, format));
	writeUSBOutString(str);
	return 0;
}

int _CAN_SetupAFLUT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* CANAFx;
	AF_SectionDef* AFSection;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANAFx = (LPC_CANAF_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AFSection = (AF_SectionDef*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_SetupAFLUT(CANAFx, AFSection));
	writeUSBOutString(str);
	return 0;
}

int _CAN_GetCTRLStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	CAN_CTRL_STS_Type arg;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	arg = (CAN_CTRL_STS_Type) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_GetCTRLStatus(CANx, arg));
	writeUSBOutString(str);
	return 0;
}

int _CAN_DeInit(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

	CAN_DeInit(CANx);
	return 0;
}

int _CAN_ReceiveMsg(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* CANx;
	CAN_MSG_Type* CAN_Msg;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANx = (LPC_CAN_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_Msg = (CAN_MSG_Type*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_ReceiveMsg(CANx, CAN_Msg));
	writeUSBOutString(str);
	return 0;
}

int _CAN_FullCANPendGetStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* CANAFx;
	FullCAN_IC_Type type;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANAFx = (LPC_CANAF_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	type = (FullCAN_IC_Type) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_FullCANPendGetStatus(CANAFx, type));
	writeUSBOutString(str);
	return 0;
}

int _CAN_GetCRStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANCR_TypeDef* CANCRx;
	CAN_CR_STS_Type arg;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANCRx = (LPC_CANCR_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	arg = (CAN_CR_STS_Type) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_GetCRStatus(CANCRx, arg));
	writeUSBOutString(str);
	return 0;
}

int _CAN_RemoveEntry(uint8_t * args)
{
	uint8_t * arg_ptr;
	AFLUT_ENTRY_Type EntryType;
	uint16_t position;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	EntryType = (AFLUT_ENTRY_Type) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	position = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_RemoveEntry(EntryType, position));
	writeUSBOutString(str);
	return 0;
}

int _CAN_FullCANIntGetStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* CANAFx;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CANAFx = (LPC_CANAF_TypeDef*) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) CAN_FullCANIntGetStatus(CANAFx));
	writeUSBOutString(str);
	return 0;
}

int _SFF_Entry_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(SFF_Entry)));
	writeUSBOutString(str);
	return 0;
}

int _SFF_Entry_controller(uint8_t * args)
{
	uint8_t * arg_ptr;
	SFF_Entry* SFF_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SFF_Entry_ptr = (SFF_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) SFF_Entry_ptr->controller);
		writeUSBOutString(str);
		return 0;
	}

	SFF_Entry_ptr->controller = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _SFF_Entry_disable(uint8_t * args)
{
	uint8_t * arg_ptr;
	SFF_Entry* SFF_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SFF_Entry_ptr = (SFF_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) SFF_Entry_ptr->disable);
		writeUSBOutString(str);
		return 0;
	}

	SFF_Entry_ptr->disable = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _SFF_Entry_id_11(uint8_t * args)
{
	uint8_t * arg_ptr;
	SFF_Entry* SFF_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SFF_Entry_ptr = (SFF_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) SFF_Entry_ptr->id_11);
		writeUSBOutString(str);
		return 0;
	}

