robovero/firmware/src/wrap/_lpc17xx_can.c
	SFF_Entry_ptr->id_11 = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _CAN_MSG_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_MSG_Type)));
	writeUSBOutString(str);
	return 0;
}

int _CAN_MSG_Type_id(uint8_t * args)
{
	uint8_t * arg_ptr;
	CAN_MSG_Type* CAN_MSG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_MSG_Type_ptr = (CAN_MSG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) CAN_MSG_Type_ptr->id);
		writeUSBOutString(str);
		return 0;
	}

	CAN_MSG_Type_ptr->id = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _CAN_MSG_Type_dataA(uint8_t * args)
{
	uint8_t * arg_ptr;
	CAN_MSG_Type* CAN_MSG_Type_ptr;
  uint8_t * dataA_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_MSG_Type_ptr = (CAN_MSG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) CAN_MSG_Type_ptr->dataA);
		writeUSBOutString(str);
		return 0;
	}

  dataA_ptr = (uint8_t *) strtoul((char *) arg_ptr, NULL, 16);
	CAN_MSG_Type_ptr->dataA[0] = dataA_ptr[0];
  CAN_MSG_Type_ptr->dataA[1] = dataA_ptr[1];
  CAN_MSG_Type_ptr->dataA[2] = dataA_ptr[2];
  CAN_MSG_Type_ptr->dataA[3] = dataA_ptr[3];
	return 0;
}

int _CAN_MSG_Type_dataB(uint8_t * args)
{
	uint8_t * arg_ptr;
	CAN_MSG_Type* CAN_MSG_Type_ptr;
  uint8_t * dataB_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_MSG_Type_ptr = (CAN_MSG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) CAN_MSG_Type_ptr->dataB);
		writeUSBOutString(str);
		return 0;
	}

	dataB_ptr = (uint8_t*) strtoul((char *) arg_ptr, NULL, 16);
	CAN_MSG_Type_ptr->dataB[0] = dataB_ptr[0];
  CAN_MSG_Type_ptr->dataB[1] = dataB_ptr[1];
  CAN_MSG_Type_ptr->dataB[2] = dataB_ptr[2];
  CAN_MSG_Type_ptr->dataB[3] = dataB_ptr[3];
	return 0;
}

int _CAN_MSG_Type_len(uint8_t * args)
{
	uint8_t * arg_ptr;
	CAN_MSG_Type* CAN_MSG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_MSG_Type_ptr = (CAN_MSG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) CAN_MSG_Type_ptr->len);
		writeUSBOutString(str);
		return 0;
	}

	CAN_MSG_Type_ptr->len = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _CAN_MSG_Type_format(uint8_t * args)
{
	uint8_t * arg_ptr;
	CAN_MSG_Type* CAN_MSG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_MSG_Type_ptr = (CAN_MSG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) CAN_MSG_Type_ptr->format);
		writeUSBOutString(str);
		return 0;
	}

	CAN_MSG_Type_ptr->format = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _CAN_MSG_Type_type(uint8_t * args)
{
	uint8_t * arg_ptr;
	CAN_MSG_Type* CAN_MSG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_MSG_Type_ptr = (CAN_MSG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) CAN_MSG_Type_ptr->type);
		writeUSBOutString(str);
		return 0;
	}

	CAN_MSG_Type_ptr->type = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _CAN_ERROR_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_ERROR)));
	writeUSBOutString(str);
	return 0;
}

int _CAN_AFMODE_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_AFMODE_Type)));
	writeUSBOutString(str);
	return 0;
}

int _CAN_CR_STS_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_CR_STS_Type)));
	writeUSBOutString(str);
	return 0;
}

int _CAN_CTRL_STS_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_CTRL_STS_Type)));
	writeUSBOutString(str);
	return 0;
}

int _AFLUT_ENTRY_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(AFLUT_ENTRY_Type)));
	writeUSBOutString(str);
	return 0;
}

int _CAN_ID_FORMAT_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_ID_FORMAT_Type)));
	writeUSBOutString(str);
	return 0;
}

int _FullCAN_Entry_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(FullCAN_Entry)));
	writeUSBOutString(str);
	return 0;
}

int _FullCAN_Entry_controller(uint8_t * args)
{
	uint8_t * arg_ptr;
	FullCAN_Entry* FullCAN_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	FullCAN_Entry_ptr = (FullCAN_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) FullCAN_Entry_ptr->controller);
		writeUSBOutString(str);
		return 0;
	}

	FullCAN_Entry_ptr->controller = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _FullCAN_Entry_disable(uint8_t * args)
{
	uint8_t * arg_ptr;
	FullCAN_Entry* FullCAN_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	FullCAN_Entry_ptr = (FullCAN_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) FullCAN_Entry_ptr->disable);
		writeUSBOutString(str);
		return 0;
	}

	FullCAN_Entry_ptr->disable = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

