robovero/firmware/src/wrap/_lpc17xx_can.c
int _FullCAN_Entry_id_11(uint8_t * args)
{
	uint8_t * arg_ptr;
	FullCAN_Entry* FullCAN_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	FullCAN_Entry_ptr = (FullCAN_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) FullCAN_Entry_ptr->id_11);
		writeUSBOutString(str);
		return 0;
	}

	FullCAN_Entry_ptr->id_11 = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _EFF_GPR_Entry_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(EFF_GPR_Entry)));
	writeUSBOutString(str);
	return 0;
}

int _EFF_GPR_Entry_controller1(uint8_t * args)
{
	uint8_t * arg_ptr;
	EFF_GPR_Entry* EFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	EFF_GPR_Entry_ptr = (EFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) EFF_GPR_Entry_ptr->controller1);
		writeUSBOutString(str);
		return 0;
	}

	EFF_GPR_Entry_ptr->controller1 = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _EFF_GPR_Entry_controller2(uint8_t * args)
{
	uint8_t * arg_ptr;
	EFF_GPR_Entry* EFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	EFF_GPR_Entry_ptr = (EFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) EFF_GPR_Entry_ptr->controller2);
		writeUSBOutString(str);
		return 0;
	}

	EFF_GPR_Entry_ptr->controller2 = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _EFF_GPR_Entry_lowerEID(uint8_t * args)
{
	uint8_t * arg_ptr;
	EFF_GPR_Entry* EFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	EFF_GPR_Entry_ptr = (EFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) EFF_GPR_Entry_ptr->lowerEID);
		writeUSBOutString(str);
		return 0;
	}

	EFF_GPR_Entry_ptr->lowerEID = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _EFF_GPR_Entry_upperEID(uint8_t * args)
{
	uint8_t * arg_ptr;
	EFF_GPR_Entry* EFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	EFF_GPR_Entry_ptr = (EFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) EFF_GPR_Entry_ptr->upperEID);
		writeUSBOutString(str);
		return 0;
	}

	EFF_GPR_Entry_ptr->upperEID = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _CAN_INT_EN_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_INT_EN_Type)));
	writeUSBOutString(str);
	return 0;
}

int _CAN_PinCFG_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_PinCFG_Type)));
	writeUSBOutString(str);
	return 0;
}

int _CAN_PinCFG_Type_RD(uint8_t * args)
{
	uint8_t * arg_ptr;
	CAN_PinCFG_Type* CAN_PinCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_PinCFG_Type_ptr = (CAN_PinCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) CAN_PinCFG_Type_ptr->RD);
		writeUSBOutString(str);
		return 0;
	}

	CAN_PinCFG_Type_ptr->RD = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _CAN_PinCFG_Type_TD(uint8_t * args)
{
	uint8_t * arg_ptr;
	CAN_PinCFG_Type* CAN_PinCFG_Type_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	CAN_PinCFG_Type_ptr = (CAN_PinCFG_Type *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) CAN_PinCFG_Type_ptr->TD);
		writeUSBOutString(str);
		return 0;
	}

	CAN_PinCFG_Type_ptr->TD = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _CAN_FRAME_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_FRAME_Type)));
	writeUSBOutString(str);
	return 0;
}

int _FullCAN_IC_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(FullCAN_IC_Type)));
	writeUSBOutString(str);
	return 0;
}

int _SFF_GPR_Entry_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(SFF_GPR_Entry)));
	writeUSBOutString(str);
	return 0;
}

int _SFF_GPR_Entry_controller1(uint8_t * args)
{
	uint8_t * arg_ptr;
	SFF_GPR_Entry* SFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SFF_GPR_Entry_ptr = (SFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) SFF_GPR_Entry_ptr->controller1);
		writeUSBOutString(str);
		return 0;
	}

	SFF_GPR_Entry_ptr->controller1 = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _SFF_GPR_Entry_disable1(uint8_t * args)
{
	uint8_t * arg_ptr;
	SFF_GPR_Entry* SFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SFF_GPR_Entry_ptr = (SFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) SFF_GPR_Entry_ptr->disable1);
		writeUSBOutString(str);
		return 0;
	}

	SFF_GPR_Entry_ptr->disable1 = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _SFF_GPR_Entry_lowerID(uint8_t * args)
{
	uint8_t * arg_ptr;
	SFF_GPR_Entry* SFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SFF_GPR_Entry_ptr = (SFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) SFF_GPR_Entry_ptr->lowerID);
		writeUSBOutString(str);
		return 0;
	}

