robovero/firmware/src/wrap/_lpc17xx_can.c
	SFF_GPR_Entry_ptr->lowerID = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _SFF_GPR_Entry_controller2(uint8_t * args)
{
	uint8_t * arg_ptr;
	SFF_GPR_Entry* SFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SFF_GPR_Entry_ptr = (SFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) SFF_GPR_Entry_ptr->controller2);
		writeUSBOutString(str);
		return 0;
	}

	SFF_GPR_Entry_ptr->controller2 = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _SFF_GPR_Entry_disable2(uint8_t * args)
{
	uint8_t * arg_ptr;
	SFF_GPR_Entry* SFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SFF_GPR_Entry_ptr = (SFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) SFF_GPR_Entry_ptr->disable2);
		writeUSBOutString(str);
		return 0;
	}

	SFF_GPR_Entry_ptr->disable2 = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _SFF_GPR_Entry_upperID(uint8_t * args)
{
	uint8_t * arg_ptr;
	SFF_GPR_Entry* SFF_GPR_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	SFF_GPR_Entry_ptr = (SFF_GPR_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) SFF_GPR_Entry_ptr->upperID);
		writeUSBOutString(str);
		return 0;
	}

	SFF_GPR_Entry_ptr->upperID = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _CAN_MODE_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(CAN_MODE_Type)));
	writeUSBOutString(str);
	return 0;
}

int _EFF_Entry_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(EFF_Entry)));
	writeUSBOutString(str);
	return 0;
}

int _EFF_Entry_controller(uint8_t * args)
{
	uint8_t * arg_ptr;
	EFF_Entry* EFF_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	EFF_Entry_ptr = (EFF_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) EFF_Entry_ptr->controller);
		writeUSBOutString(str);
		return 0;
	}

	EFF_Entry_ptr->controller = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _EFF_Entry_ID_29(uint8_t * args)
{
	uint8_t * arg_ptr;
	EFF_Entry* EFF_Entry_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	EFF_Entry_ptr = (EFF_Entry *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) EFF_Entry_ptr->ID_29);
		writeUSBOutString(str);
		return 0;
	}

	EFF_Entry_ptr->ID_29 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _AF_SectionDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(AF_SectionDef)));
	writeUSBOutString(str);
	return 0;
}

int _AF_SectionDef_FullCAN_Sec(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->FullCAN_Sec);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->FullCAN_Sec = (FullCAN_Entry*) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _AF_SectionDef_FC_NumEntry(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->FC_NumEntry);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->FC_NumEntry = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _AF_SectionDef_SFF_Sec(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->SFF_Sec);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->SFF_Sec = (SFF_Entry*) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _AF_SectionDef_SFF_NumEntry(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->SFF_NumEntry);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->SFF_NumEntry = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _AF_SectionDef_SFF_GPR_Sec(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->SFF_GPR_Sec);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->SFF_GPR_Sec = (SFF_GPR_Entry*) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _AF_SectionDef_SFF_GPR_NumEntry(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->SFF_GPR_NumEntry);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->SFF_GPR_NumEntry = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

