robovero/firmware/src/wrap/_lpc17xx_can.c
int _AF_SectionDef_EFF_Sec(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->EFF_Sec);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->EFF_Sec = (EFF_Entry*) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _AF_SectionDef_EFF_NumEntry(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->EFF_NumEntry);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->EFF_NumEntry = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _AF_SectionDef_EFF_GPR_Sec(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->EFF_GPR_Sec);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->EFF_GPR_Sec = (EFF_GPR_Entry*) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _AF_SectionDef_EFF_GPR_NumEntry(uint8_t * args)
{
	uint8_t * arg_ptr;
	AF_SectionDef* AF_SectionDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	AF_SectionDef_ptr = (AF_SectionDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) AF_SectionDef_ptr->EFF_GPR_NumEntry);
		writeUSBOutString(str);
		return 0;
	}

	AF_SectionDef_ptr->EFF_GPR_NumEntry = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

